In [199]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [201]:
pd.options.display.float_format = "{:.2f}".format

In [203]:
transactions = pd.read_csv(r"C:\Users\91638\OneDrive\Desktop\project DA\transactions.csv")

In [205]:
products = pd.read_csv(r"C:\Users\91638\OneDrive\Desktop\project DA\products.csv")

In [207]:
markets = pd.read_csv(r"C:\Users\91638\OneDrive\Desktop\project DA\markets.csv")
customers = pd.read_csv(r"C:\Users\91638\OneDrive\Desktop\project DA\customers.csv")
date = pd.read_csv(r"C:\Users\91638\OneDrive\Desktop\project DA\date.csv")

In [209]:
transactions.head(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR

In [211]:
products.sample(2)

    product_code  product_type
256      Prod257     Own Brand
173      Prod174  Distribution

In [213]:
customers.sample(2)

   customer_code        custmer_name   customer_type
11        Cus012  Integration Stores  Brick & Mortar
9         Cus010        Atlas Stores  Brick & Mortar

In [215]:
markets.sample(2)

   markets_code markets_name     zone
7       Mark008      Lucknow    North
12      Mark013       Bhopal  Central

In [217]:
date.sample(2)

           date     cy_date  year month_name date_yy_mmm
716  2019-05-18  2019-05-01  2019        May      19-May
597  2019-01-19  2019-01-01  2019    January      19-Jan

In [219]:
transactions.dtypes

product_code      object
customer_code     object
market_code       object
order_date        object
sales_qty          int64
sales_amount     float64
currency          object
dtype: object

In [221]:
transactions.isnull().sum()

product_code     0
customer_code    0
market_code      0
order_date       0
sales_qty        0
sales_amount     0
currency         0
dtype: int64

In [223]:
transactions[transactions['sales_amount'] <= 0].sample(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
101504,Prod284,Cus004,Mark010,2019-11-04,1,0.00,INR
54101,Prod149,Cus015,Mark003,2019-11-20,1,0.00,INR
104701,Prod287,Cus004,Mark010,2019-01-31,1,0.00,INR

In [225]:
len(transactions[transactions['sales_amount'] <= 0])

1611

In [227]:
transactions.shape

(150283, 7)

In [229]:
transactions['currency'].unique()

array(['INR', 'USD'], dtype=object)

In [231]:
transactions[transactions['currency'] == 'USD']

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
5,Prod003,Cus005,Mark004,2017-11-20,59,500.00,USD
6,Prod003,Cus005,Mark004,2017-11-22,36,250.00,USD
286,Prod003,Cus005,Mark004,2017-11-20,59,500.00,USD
287,Prod003,Cus005,Mark004,2017-11-22,36,250.00,USD

In [233]:
transactions[transactions['currency'] == 'USD']['sales_amount']

5     500.00
6     250.00
286   500.00
287   250.00
Name: sales_amount, dtype: float64

In [235]:
val = transactions[transactions['currency'] == 'USD'].index
val

Index([5, 6, 286, 287], dtype='int64')

In [237]:
for x in val:
    transactions.at[x,'sales_amount'] = transactions.at[x,'sales_amount']*75
    transactions.at[x,'currency'] = 'INR'
transactions.loc[val]

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
5,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR
6,Prod003,Cus005,Mark004,2017-11-22,36,18750.00,INR
286,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR
287,Prod003,Cus005,Mark004,2017-11-22,36,18750.00,INR

In [239]:
transactions['product_price'] = transactions['sales_amount'] / transactions['sales_qty']
transactions.head(4)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR,-0.33
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00

In [241]:
transactions.isnull().sum()

product_code     0
customer_code    0
market_code      0
order_date       0
sales_qty        0
sales_amount     0
currency         0
product_price    0
dtype: int64

In [243]:
def calc_perc(y):
    profit = 8
    
    if y > 4000:
        profit = 23
    elif y > 3000:
        profit = 19
    elif y > 2000:
        profit = 17
    elif y > 1000:
        profit = 15
    elif y > 500:
        profit = 13
    elif y > 100:
        profit = 11
    else:
        profit = 8
        
    return profit

In [245]:
transactions['profit_percentage'] = transactions['product_price'].apply(calc_perc)
transactions.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR,-0.33,8
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15

In [247]:
transactions.shape

(150283, 9)

In [249]:
transactions['profit_percentage'].isnull().sum()
transactions.isnull().sum()

product_code         0
customer_code        0
market_code          0
order_date           0
sales_qty            0
sales_amount         0
currency             0
product_price        0
profit_percentage    0
dtype: int64

In [251]:
transactions['original_price'] = (transactions['product_price'] - (transactions['product_price']*(transactions['profit_percentage'] / 100)))

In [253]:
transactions.head(4)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR,-0.33,8,-0.31
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21

In [255]:
transactions['profit'] = transactions['product_price']*(transactions['profit_percentage'] / 100)
transactions.head(4)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR,-0.33,8,-0.31,-0.03
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,113.75
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21,75.79

In [257]:
transactions['total_profit'] = (transactions['sales_qty'])*(transactions['product_price']*(transactions['profit_percentage'] / 100))

In [259]:
transactions.head(4)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR,-0.33,8,-0.31,-0.03,-0.08
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,113.75,113.75
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21,75.79,75.79

In [261]:
transactions['total_cost'] = (transactions['sales_amount'])-(transactions['total_profit'])
transactions.head(4)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,total_cost
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,36704.49
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR,-0.33,8,-0.31,-0.03,-0.08,-0.92
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,113.75,113.75,761.25
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21,75.79,75.79,507.21

In [263]:
transactions['sales_amount'].sum()

986676766.0

In [265]:
transactions['total_cost'].sum()

849375727.0600001

In [267]:
transactions['total_profit'].sum()

137301038.94000003

In [269]:
(transactions['total_cost'].sum() + transactions['total_profit'].sum()) - transactions['sales_amount'].sum()

1.1920928955078125e-07

In [271]:
transactions.shape

(150283, 13)

In [273]:
products.head(3)

  product_code product_type
0      Prod001    Own Brand
1      Prod002    Own Brand
2      Prod003    Own Brand

In [275]:
products['product_type'].unique()

array(['Own Brand', 'Distribution'], dtype=object)

In [277]:
products['product_code'].nunique()

279

In [279]:
len(products[products['product_type'] == 'Own Brand'])

191

In [281]:
len(products[products['product_type'] == 'Distribution'])

88

In [283]:
transactions['product_code'].nunique()

339

In [285]:
prod_code1 = pd.Series(products['product_code'].unique())
prod_code2 = pd.Series(transactions['product_code'].unique())
prod_code1.tail()

274    Prod275
275    Prod276
276    Prod277
277    Prod278
278    Prod279
dtype: object

In [287]:
prod_code2.tail()

334    Prod335
335    Prod336
336    Prod337
337    Prod338
338    Prod339
dtype: object

In [289]:
products['product_code'].nunique()

279

In [291]:
products.tail()

    product_code  product_type
274      Prod275     Own Brand
275      Prod276     Own Brand
276      Prod277     Own Brand
277      Prod278  Distribution
278      Prod279  Distribution

In [293]:
transactions.shape

(150283, 13)

In [295]:
transactions2 = pd.merge(transactions, products, how='inner', on='product_code')

In [297]:
transactions2.sample(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,total_cost,product_type
3839,Prod047,Cus023,Mark002,2019-07-31,1,1278.00,INR,1278.00,15,1086.30,191.70,191.70,1086.30,Own Brand
1447,Prod018,Cus022,Mark002,2020-05-01,7,15315.00,INR,2187.86,17,1815.92,371.94,2603.55,12711.45,Own Brand
87488,Prod271,Cus024,Mark011,2019-01-28,1,56.00,INR,56.00,8,51.52,4.48,4.48,51.52,Own Brand

In [299]:
transactions2.shape

(95124, 14)

In [301]:
customers.head(3)

  customer_code  custmer_name   customer_type
0        Cus001  Surge Stores  Brick & Mortar
1        Cus002  Nomad Stores  Brick & Mortar
2        Cus003  Excel Stores  Brick & Mortar

In [303]:
customers['customer_type'].unique()

array(['Brick & Mortar', 'E-Commerce'], dtype=object)

In [305]:
customers['customer_type'].nunique()

2

In [307]:
customers['customer_code'].nunique()

38

In [309]:
transactions2['customer_code'].nunique()

38

In [311]:
transactions2.shape

(95124, 14)

In [313]:
transactions3 = pd.merge(transactions2, customers, how='inner', on='customer_code')

In [315]:
transactions3.sample(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,total_cost,product_type,custmer_name,customer_type
49563,Prod134,Cus019,Mark011,2017-10-31,2,486.00,INR,243.00,11,216.27,26.73,53.46,432.54,Own Brand,Electricalsopedia Stores,Brick & Mortar
87266,Prod271,Cus016,Mark002,2018-11-09,1,83.00,INR,83.00,8,76.36,6.64,6.64,76.36,Own Brand,Logic Stores,Brick & Mortar
82035,Prod267,Cus020,Mark011,2019-08-08,1,116.00,INR,116.00,11,103.24,12.76,12.76,103.24,Distribution,Nixon,E-Commerce

In [317]:
transactions3.shape

(95124, 16)

In [319]:
markets.columns

Index(['markets_code', 'markets_name', 'zone'], dtype='object')

In [321]:
markets = markets.rename(columns={"markets_code": "market_code", "markets_name": "market_name"})

In [323]:
markets.head(3)

  market_code market_name     zone
0     Mark001     Chennai    South
1     Mark002      Mumbai  Central
2     Mark003   Ahmedabad    North

In [325]:
markets['market_name'].unique()

array(['Chennai', 'Mumbai', 'Ahmedabad', 'Delhi NCR', 'Kanpur',
       'Bengaluru', 'Bhopal', 'Lucknow', 'Patna', 'Kochi', 'Nagpur',
       'Surat', 'Hyderabad', 'Bhubaneshwar'], dtype=object)

In [327]:
markets['market_name'].nunique()

14

In [329]:
markets['zone'].unique()

array(['South', 'Central', 'North'], dtype=object)

In [331]:
markets['zone'].nunique()

3

In [333]:
markets['market_code'].nunique()

15

In [335]:
transactions3.shape

(95124, 16)

In [337]:
transactions4 = pd.merge(transactions3, markets, how='inner', on='market_code')

In [339]:
transactions4.head(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,total_cost,product_type,custmer_name,customer_type,market_name,zone
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,36704.49,Own Brand,Surge Stores,Brick & Mortar,Chennai,South
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR,-0.33,8,-0.31,-0.03,-0.08,-0.92,Own Brand,Nomad Stores,Brick & Mortar,Mumbai,Central
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,113.75,113.75,761.25,Own Brand,Excel Stores,Brick & Mortar,Ahmedabad,North

In [341]:
transactions4.shape

(95124, 18)

In [343]:
date.columns

Index(['date', 'cy_date', 'year', 'month_name', 'date_yy_mmm'], dtype='object')

In [345]:
date = date.rename(columns={"date": "order_date"})

In [347]:
date.head(3)

   order_date     cy_date  year month_name date_yy_mmm
0  2017-06-01  2017-06-01  2017       June      17-Jun
1  2017-06-02  2017-06-01  2017       June      17-Jun
2  2017-06-03  2017-06-01  2017       June      17-Jun

In [349]:
date['order_date'].nunique()

1126

In [350]:
transactions4['order_date'].nunique()

803

In [353]:
transactions4.shape

(95124, 18)

In [355]:
transactions5 = pd.merge(transactions4, date, how='inner', on='order_date')

In [357]:
transactions5.head(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,...,total_cost,product_type,custmer_name,customer_type,market_name,zone,cy_date,year,month_name,date_yy_mmm
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,...,36704.49,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR,-0.33,8,-0.31,...,-0.92,Own Brand,Nomad Stores,Brick & Mortar,Mumbai,Central,2018-05-01,2018,May,18-May
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,...,761.25,Own Brand,Excel Stores,Brick & Mortar,Ahmedabad,North,2018-04-01,2018,April,18-Apr

In [359]:
transactions5.shape

(95124, 22)

In [361]:
transactions5.to_csv('transactions_all.csv', index=False)

In [362]:
transactions5.columns

Index(['product_code', 'customer_code', 'market_code', 'order_date',
       'sales_qty', 'sales_amount', 'currency', 'product_price',
       'profit_percentage', 'original_price', 'profit', 'total_profit',
       'total_cost', 'product_type', 'custmer_name', 'customer_type',
       'market_name', 'zone', 'cy_date', 'year', 'month_name', 'date_yy_mmm'],
      dtype='object')

In [365]:

len(transactions5.columns)

22

In [367]:
transactions5.dtypes

product_code          object
customer_code         object
market_code           object
order_date            object
sales_qty              int64
sales_amount         float64
currency              object
product_price        float64
profit_percentage      int64
original_price       float64
profit               float64
total_profit         float64
total_cost           float64
product_type          object
custmer_name          object
customer_type         object
market_name           object
zone                  object
cy_date               object
year                   int64
month_name            object
date_yy_mmm           object
dtype: object

In [369]:
df = pd.read_csv('./transactions_all.csv')

In [370]:
df.head(2)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,...,total_cost,product_type,custmer_name,customer_type,market_name,zone,cy_date,year,month_name,date_yy_mmm
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,...,36704.49,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR,-0.33,8,-0.31,...,-0.92,Own Brand,Nomad Stores,Brick & Mortar,Mumbai,Central,2018-05-01,2018,May,18-May

In [373]:
df.shape

(95124, 22)

In [375]:
df['sales_amount'].sum()

517715527.0

In [377]:
df['total_cost'].sum()

452453087.92999995

In [379]:
df['total_profit'].sum()

65262439.07000001

In [381]:
df['sales_amount'].sum() - (df['total_cost'].sum() + df['total_profit'].sum())

5.960464477539063e-08